Revit 2026 API

# GroupLoadOptionsIncludeGrids Property

---

True if grids should be brought in from the input file, false otherwise. The default value is .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IncludeGrids { get; set; }
```
```vb
Public Property IncludeGrids As Boolean
	Get
	Set
```
```cpp
public:
property bool IncludeGrids {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IncludeGrids : bool with get, set
```

#### Property Value

Boolean

#### Reference

GroupLoadOptions Class

Autodesk.Revit.DB Namespace